Revit 2026 API

# FabricSheetTypeSetLayoutAsCustomPattern Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutAsCustomPattern(
	double minorStartOverhang,
	double majorStartOverhang,
	IList<FabricWireItem> minorFabricWireItems,
	IList<FabricWireItem> majorFabricWireItems
)
```
```vb
Public Sub SetLayoutAsCustomPattern (
	minorStartOverhang As Double,
	majorStartOverhang As Double,
	minorFabricWireItems As IList(Of FabricWireItem),
	majorFabricWireItems As IList(Of FabricWireItem)
)
```
```cpp
public:
void SetLayoutAsCustomPattern(
	double minorStartOverhang,
	double majorStartOverhang,
	IList<FabricWireItem^>^ minorFabricWireItems,
	IList<FabricWireItem^>^ majorFabricWireItems
)
```
```fsharp
member SetLayoutAsCustomPattern :
        minorStartOverhang : float *
        majorStartOverhang : float *
        minorFabricWireItems : IList<FabricWireItem> *
        majorFabricWireItems : IList<FabricWireItem> -> unit
```

#### Parameters

minorStartOverhang Double

majorStartOverhang Double

minorFabricWireItems IListFabricWireItem

majorFabricWireItems IListFabricWireItem

#### Reference

FabricSheetType Class

Autodesk.Revit.DB.Structure Namespace